{
  "last_updated": "2025-06-28T17:09:42.780736",
  "total_blogs": 7,
  "blogs": [
    {
      "title": "Web Development Insights: Learn HTML, CSS, JavaScript & SEO Tips",
      "description": "Gain practical web development insights covering HTML, CSS, JavaScript, SEO techniques, and performance best practices to build responsive and fast websites.",
      "excerpt": "Welcome to Blog Post 1 by Nahush Patel, where we delve into the world of web development. In this post, we explore essential tips and techniques for creating responsive, user-friendly websites.",
      "image": "blog-img/blog1-image.png",
      "date": "06/28/2025",
      "filename": "blog6",
      "link": "blog-list/blog6.html"
    },
    {
      "title": "Mastering JavaScript Frameworks: React, Vue, and Angular",
      "description": "Learn how to master popular JavaScript frameworks like React, Vue, and Angular to build modern, dynamic web applications.",
      "excerpt": "Welcome to our in-depth guide on mastering JavaScript frameworks. In this post, we'll explore React, Vue, and Angular to help you choose the right tool for your next web development project.",
      "image": "../blog-img/Mastering JavaScript Frameworks.png",
      "date": "06/28/2025",
      "filename": "5-free-ai-tools",
      "link": "blog-list/5-free-ai-tools.html"
    },
    {
      "title": "Web Development Insights: Learn HTML, CSS, JavaScript & SEO Tips",
      "description": "Gain practical web development insights covering HTML, CSS, JavaScript, SEO techniques, and performance best practices to build responsive and fast websites.",
      "excerpt": "Welcome to Blog Post 1 by Nahush Patel, where we delve into the world of web development. In this post, we explore essential tips and techniques for creating responsive, user-friendly websites.",
      "image": "blog-img/blog1-image.png",
      "date": "06/28/2025",
      "filename": "blog1",
      "link": "blog-list/blog1.html"
    },
    {
      "title": "How AI is Revolutionizing Web Development | Nahush Patel",
      "description": "Discover how AI tools like GitHub Copilot, ChatGPT, and AI-powered testing are transforming modern web development workflows.",
      "excerpt": "The integration of Artificial Intelligence in web development is no longer futuristic—it's here. As a developer, understanding these tools can give you a competitive edge. Here's how AI is changing ou...",
      "image": "blog-img/copilot-demo.gif",
      "date": "05/14/2025",
      "filename": "blog5",
      "link": "blog-list/blog5.html"
    },
    {
      "title": "SEO Fundamentals Every Developer Should Know | Nahush Patel",
      "description": "Essential SEO techniques for web developers to improve site visibility and ranking. Learn technical SEO, on-page optimization, and performance best practices.",
      "excerpt": "As developers, we often focus on functionality while overlooking how easily our sites can be discovered. In this guide, I'll share essential SEO techniques that should be part of every developer's too...",
      "image": "img/moon-icon.png",
      "date": "05/14/2025",
      "filename": "blog4",
      "link": "blog-list/blog4.html"
    },
    {
      "title": "Web Development Best Practices: Build Scalable, High-Performing Websites",
      "description": "Learn essential web development best practices for writing clean, responsive, and secure code. Improve performance, accessibility, SEO, and maintainability in your projects.",
      "excerpt": "Welcome to this in-depth guide on web development best practices by Nahush Patel. In this blog, we explore essential strategies and techniques for creating fast, responsive, and user-centric websites ...",
      "image": "blog-img/Web Development Best Practices.png",
      "date": "05/08/2025",
      "filename": "blog2",
      "link": "blog-list/blog2.html"
    },
    {
      "title": "Mastering JavaScript Frameworks: Choosing the Right Tool for Your Web Projects",
      "description": "Mastering JavaScript Frameworks: Choosing the Right Tool for Your Web Projects. Explore the strengths of React, Vue, and Angular to make informed decisions for your web development projects.",
      "excerpt": "Welcome to this comprehensive guide on JavaScript frameworks by Nahush Patel. JavaScript has become the backbone of modern web applications, and frameworks like React, Vue, and Angular have revolution...",
      "image": "blog-img/Mastering JavaScript Frameworks.png",
      "date": "05/07/2025",
      "filename": "blog3",
      "link": "blog-list/blog3.html"
    }
  ]
}