{
  "last_updated": "2025-06-28T21:05:45.737511",
  "total_blogs": 4,
  "blogs": [
    {
      "title": "Best AI Tools for Web Developers in 2025",
      "description": "Discover the top AI tools that every web developer should use in 2025. From code generation to testing automation, these tools will revolutionize your workflow.",
      "excerpt": "Welcome to this comprehensive guide on AI tools for web developers by Nahush Patel. In today's rapidly evolving web development landscape, artificial intelligence has become an indispensable part of t...",
      "image": "../blog-img/best-ai-tools-for-web-developers-2025.png",
      "published_date": "06/28/2025",
      "published_time": "09:05 PM",
      "filename": "best-ai-tools-for-web-developers-2025",
      "link": "best-ai-tools-for-web-developers-2025.html"
    },
    {
      "title": "Top JavaScript Frameworks to Learn in 2025",
      "description": "Explore the top JavaScript frameworks to learn in 2025. Discover which frameworks are most in-demand and how to choose the right one for your projects.",
      "excerpt": "Welcome to this expert guide on JavaScript frameworks for 2025 by Nahush Patel. Discover the most in-demand frameworks and how to choose the best one for your needs.",
      "image": "../blog-img/top-javascript-frameworks-to-learn-2025.png",
      "published_date": "06/28/2025",
      "published_time": "05:54 PM",
      "filename": "top-javascript-frameworks-to-learn-2025",
      "link": "top-javascript-frameworks-to-learn-2025.html"
    },
    {
      "title": "Mastering JavaScript Frameworks: React, Vue, and Angular",
      "description": "Learn how to master popular JavaScript frameworks like React, Vue, and Angular to build modern, dynamic web applications.",
      "excerpt": "ks. In this post, we'll explore React, Vue, and Angular to help you choose the right tool for your next web development project.",
      "image": "../blog-img/Mastering JavaScript Frameworks.png",
      "published_date": "06/28/2025",
      "published_time": "04:39 PM",
      "filename": "5-free-ai-tools",
      "link": "5-free-ai-tools.html"
    },
    {
      "title": "Web Development Insights: Learn HTML, CSS, JavaScript & SEO Tips",
      "description": "Gain practical web development insights covering HTML, CSS, JavaScript, SEO techniques, and performance best practices to build responsive and fast websites.",
      "excerpt": "Welcome to Blog Post 1 by Nahush Patel, where we delve into the world of web development. In this post, we explore essential tips and techniques for creating responsive, user-friendly websites.",
      "image": "../blog-img/top-javascript-frameworks-to-learn-2025.png",
      "published_date": "06/28/2025",
      "published_time": "04:39 PM",
      "filename": "blog1",
      "link": "blog1.html"
    }
  ]
}